var lvivData = [
  {
    "latitude": "49.8008965",
    "longitude": "23.9422635",
    "title": "Sknyliv",
    "titleCyrillic": "Скнилів",
    "date": "2.08.2014 - 18.02.2015",
    "description": "",
    "descriptionCyrillic": "",
    "link": ""
  },
  {
    "latitude": "49.824252",
    "longitude": "23.9920326",
    "title": "Kulparkivskyi park",
    "titleCyrillic": "Кульпарківський парк/сквер",
    "date": "30.08.2014",
    "description": "",
    "descriptionCyrillic": "Скверик у престижному районі Львова – на вулиці Коновальця – місцеві чоловіки використовують як туалет. Незважаючи на те, що тут гуляють матері з дітьми, чоловіки випивають на лавочках та, не соромлячись, справляють нужду.",
    "link": ""
  },
  {
    "latitude": "49.8230022",
    "longitude": "23.9943049",
    "title": "Trush museum",
    "titleCyrillic": "Музей -Труша-",
    "date": "30.08.2014",
    "description": "",
    "descriptionCyrillic": "Художньо-меморіальний музей Івана Труша – відділ Національного музею у Львові, відкритий у 1986 році та розташований у вишуканій двоповерховій віллі, збудованій у 1910 році за проектом знаного архітектора О. Лушпинського у стилі модерн, в якій художник мешкав разом із сім’єю впродовж 1910–1941 рр. Із часу відкриття тут діє постійна експозиція, розгорнена у двох розділах. Перший презентує різні сфери мистецького та суспільного життя Галичини на зламі ХІХ–ХХ століть. Добірка фотографій та епістолярна спадщина із архіву митця розкривають його як непересічну особистість, а низка теоретичних публікацій, роздумів на актуальні теми культурного та мистецького життя – як критика та громадського діяча. У другому розділі експозиції пропонується творчий доробок художника, який представляє його як творця ліричного пейзажу, майстра психологічного портрету та автора численних тематичних жанрових композицій.",
    "link": "http://goo.gl/ztA2SV"
  },
  {
    "latitude": "49.8238193",
    "longitude": "23.997443",
    "title": "Piskovi ozera",
    "titleCyrillic": "Піскові озера",
    "date": "30.08.2014",
    "description": "",
    "descriptionCyrillic": "Парк був облаштований у 1960-ті роки на місці зруйнованого ландшафту — колишніх кар'єрів з видобутку піску. Озера утворилися через просочування води на дно піщаної виїмки. В середині ХХ століття на місці парку було сміттєзвалище. У радянський період озера називалися Алтайськими, під час перейменувань на початку 1990-х років були названі Пісковими. Основу насаджень парку становлять ясен звичайний та ясен американський, а також гостролистий клен та клен-явір. Інші породи дерев: клен ясенолістий, клен сріблястий, біла акація, каштан кінський, черешня, алича, кедри. В підліску та узліссях ростуть чагарники: бузина чорна та інші. У парку є спортивний і дитячий майданчики.",
    "link": "https://goo.gl/e9jQtT"
  },
  {
    "latitude": "49.8258951",
    "longitude": "24.0033074",
    "title": "",
    "titleCyrillic": "Національний Лісотехнічний Університет",
    "date": "30.08.2014",
    "description": "",
    "descriptionCyrillic": "Ботанічний сад Національного лісотехнічного університету України (м. Львів) cтворений Постановою Ради Міністрів Української РСР від 22 лютого 1991 року № 33 та Постановою Кабінету Міністрів України від 12 жовтня 1992 року № 584 на основі дендрарію та дендропарку (м. Львів) і арборетуму в селі Страдч Яворівського району Львівської області. У 1995 році рішенням Львівської міської ради Ботанічному саду в постійне користування було передано земельну ділянку площею 3,35 га, де зараз функціонує розсадник деревно-чагарникових рослин.",
    "link": "http://www.nltu.edu.ua"
  },
  {
    "latitude": "49.8353277",
    "longitude": "24.0144292",
    "title": "",
    "titleCyrillic": "Національний університет Львівська політехніка",
    "date": "06.09.2014",
    "description": "",
    "descriptionCyrillic": "Найстаріший вищий технічний навчальний заклад України та Східної Європи, заснований 1844 року як Технічна академія. Університет складається з 16 інститутів, 114 кафедр, відокремлених навчальних закладів, громадських організацій та загальних підрозділів.",
    "link": "http://www.lp.edu.ua"
  },
  {
    "latitude": "49.8297098",
    "longitude": "24.0042998",
    "title": "",
    "titleCyrillic": "Дворец Спорта",
    "date": "25.10.2014",
    "description": "",
    "descriptionCyrillic": "",
    "link": ""
  },
  {
    "latitude": "49.8384128",
    "longitude": "24.0196595",
    "title": "",
    "titleCyrillic": "Парк им. И. Франко",
    "date": "*",
    "description": "",
    "descriptionCyrillic": "Памятник садово-паркового искусства местного значения (с 1984). Парк охраняется как национальное достояние, это природоохранный и рекреационный объект. Парк имени Франко расположен на склоне взгорья, возвышающегося над Львовской котловиной в центральной части города. Ограничен улицами Крушельницкой (бывшая Чернышевского), Университетской, Листопадового Чина и Яна Матейко. В партерной части парка находится комплекс памятника Ивану Франко, расположенный напротив Львовского университета; напротив верхней части парка находится гостиница «Днестр». Общая площадь парка Ивана Франко составляет 10,6 га.",
    "link": "https://goo.gl/WKfW9B"
  },
  {
    "latitude": "49.8401739",
    "longitude": "24.0083423",
    "title": "",
    "titleCyrillic": "улица Одесская",
    "date": "30.08.2014",
    "description": "",
    "descriptionCyrillic": "",
    "link": ""
  },
  {
    "latitude": "49.842426",
    "longitude": "24.0097781",
    "title": "",
    "titleCyrillic": "пл. Князя Святослава /парковка/",
    "date": "30.08.2014",
    "description": "",
    "descriptionCyrillic": "",
    "link": ""
  },
  {
    "latitude": "49.8380642",
    "longitude": "24.0045399",
    "title": "Synagoga Cori Gilod",
    "titleCyrillic": "Большая синагога Цори Гилод",
    "date": "30.08.2014",
    "description": "",
    "descriptionCyrillic": "Сегодняйшей религиозной общины Бейс Аарон ве Исраэль (дом Аарона и Израиля) — действующая синагога (сохранилась до наших дней вместе с настенной живописью в интерьере) львовской еврейской общины. Построенная в 1924 г. на ул. Короля Лещинского (ныне на ул. Братьев Михновских), № 4 на средства Благотворительного общества «Цори Гилод» по проекту архитектора Альберта Корнблута. Расписана зимой 1935—1936 г. художником Максимилианом Кугелем[17]. В 2007 году был закончен ремонт синагоги по проекту израильского архитектора Аарона Острайхера.",
    "link": "https://goo.gl/nSCOjy"
  },
  {
    "latitude": "49.8371549",
    "longitude": "24.0139563",
    "title": "",
    "titleCyrillic": "Площадь св. Юра",
    "date": "06.09.2014",
    "description": "",
    "descriptionCyrillic": "",
    "link": ""
  },
  {
    "latitude": "49.8435689",
    "longitude": "24.0281375",
    "title": "",
    "titleCyrillic": "пл. Вечевая",
    "date": "*",
    "description": "",
    "descriptionCyrillic": "",
    "link": ""
  },
  {
    "latitude": "49.84184",
    "longitude": "24.0312977",
    "title": "",
    "titleCyrillic": "Ратуша",
    "date": "07.01.2015",
    "description": "",
    "descriptionCyrillic": "Здание городской администрации.",
    "link": ""
  },
  {
    "latitude": "49.8443892",
    "longitude": "24.0459111",
    "title": "",
    "titleCyrillic": "Парк Знесіння",
    "date": "",
    "description": "",
    "descriptionCyrillic": "",
    "link": ""
  },
  {
    "latitude": "49.8324605",
    "longitude": "24.0561303",
    "title": "",
    "titleCyrillic": "Личаковское кладбище",
    "date": "06.01.2015",
    "description": "",
    "descriptionCyrillic": "Историко-мемориальный музей-заповедник (с 1991 года) во Львове в исторической местности Лычаков, одно из старейших кладбищ Украины.",
    "link": "https://goo.gl/m5r4ZB"
  },
  {
    "latitude": "49.836602",
    "longitude": "24.023049",
    "title": "",
    "titleCyrillic": "Колокольня греко-католической церкви Святого Духа",
    "date": "08.11.2014",
    "description": "",
    "descriptionCyrillic": "Церковь 1722—1729 гг. Часы на колокольне установлены в 1786. Взорвана в 1939. Музей украинской литературы XIX века",
    "link": ""
  },
  {
    "latitude": "49.842264",
    "longitude": "24.033062",
    "title": "",
    "titleCyrillic": "Итальянский дворик",
    "date": "24.08.2014",
    "description": "",
    "descriptionCyrillic": "Львівський історичний музей – один з найстаріших і найбагатших музеїв України, заснований у 1893 році. Датою другого народження музею можна вважати 1940 р., коли розташовані поряд Історичний музей м. Львова та Національний музей імені короля Яна ІІІ (засн. 1908 р.) були об'єднані в одну установу – Львівський історичний музей (ЛІМ). До складу фондового зібрання новоутвореного музею увійшли також окремі колекції колишніх львівських музеїв, зокрема, Музею імені князів Любомирських, Музею Наукового Товариства імені Шевченка, Музею Ставропігійського інституту.",
    "link": "http://www.lhm.lviv.ua"
  },
  {
    "latitude": "49.8386637",
    "longitude": "24.012947",
    "title": "",
    "titleCyrillic": "Собор св. Юра",
    "date": "06.09.2014",
    "description": "Невід’ємною частиною історико-архітектурного заповідника й одним із привабливих куточків Львова є архітектурний ансамбль на Святоюрській горі. Архикатедральний Собор Святого Юра — пам’ятка пізнього українського бароко, що є домінантною в містобудівельному середовищі.",
    "descriptionCyrillic": "Карта Львов -от святогорской горы до высокозамковой-. [01.1]",
    "link": "http://sobor-svyura.lviv.ua"
  },
  {
    "latitude": "49.83692",
    "longitude": "24.0048627",
    "title": "",
    "titleCyrillic": "Давній костел Ельжбети",
    "date": "30.08.2014",
    "description": "",
    "descriptionCyrillic": "Карта Львов -от святогорской горы до высокозамковой-. [02.1]. Нині: церква свв. Ольги та Елізавети УГКЦ. Місцем спорудження обрали площу Солярні, обабіч вулиці Городоцької. Вибір було зроблено так, щоб споруда костелу закривала від головного вокзалу вид на Собор св. Юра, який був грекокатолицьким, і нагадував всім прибуваючим до Львова залізницею, що тут живуть українці. Будувався костьол за кошти залізничників для їхньої парафії. Був проведений конкурс проектів, в якому взяло участь 19 учасників, серед яких найкращим був визнаний проект під девізом «Тріо», виконаний професором Львівського політехнічного інституту Теодором Тальовським (1857–1910) – відомим архітектором свого часу, вихованцем політехніки Відня та Львова, учнем львівського архітектора Юліана Захарієвича.",
    "link": "http://olha-church.org.ua/web"
  },
  {
    "latitude": "49.8400355",
    "longitude": "24.0137054",
    "title": "Circus",
    "titleCyrillic": "Цирк",
    "date": "30.08.2014",
    "description": "",
    "descriptionCyrillic": "Карта Львов -от святогорской горы до высокозамковой-. [03.1]. 1969",
    "link": "http://www.lvivcirk.com"
  },
  {
    "latitude": "49.8371847",
    "longitude": "24.0166576",
    "title": "Hotel Dnister",
    "titleCyrillic": "Отель Днистер",
    "date": "",
    "description": "«Днистер» — отель во Львове, построенный в 1983 году. Он расположен на живописном холме около старинного парка. Здесь в конце XIX века находились павильоны, где художники писали фрагменты знаменитого полотна «Рацлавицка панорама». Позже панорама экспонировалась в специальной ротонде в Стрыйском парке и была одной из главных достопримечательностей, которыми славился довоенный Львов.",
    "descriptionCyrillic": "Карта Львов -от святогорской горы до высокозамковой-. [04.1]",
    "link": "http://www.dnister.lviv.ua/ru"
  },
  {
    "latitude": "49.8351583",
    "longitude": "24.0174557",
    "title": "",
    "titleCyrillic": "Давній костел св. Марії Магдалини",
    "date": "06.09.2014",
    "description": "",
    "descriptionCyrillic": "Карта Львов -от святогорской горы до высокозамковой-. [05.1]. Нині: Будинок органної та камерної музики. В 1600 году владелица участка, называемого «100 полей», А. Пстроконская подарила землю вместе с двором и садом монахам-доминиканцам под постройку семинарии. Вопреки решению магистрата, монахи начали строить деревянный костёл. Городские власти выступили против, поскольку укрепленное место на горе, попав в руки врага, могло представлять опасность для Львова и земли церкви не облагались налогом. Здание римокатолического костёла святой Марии Магдалены было построено между 1600 и 1612 годами монахами-доминиканцами за городскими стенами к югу от городских стен Львова, на месте старого деревянного костёла. Рядом была построена семинария и келии монастыря. Авторами проекта были архитекторы А.Келар и Я.Годный. Строительство было закончено в 1635 году. В 1648 году монастырские укрепления, как и близлежащий монастырь Святого Лазаря, захватили войска Богдана Хмельницкого. Впоследствии здание неоднократно подвергалось изменениям. В 1932 году здесь был установлен изготовленный в Чехии орган фирмы «Rieger-Kloss». Он самый большой на территории Украины.",
    "link": "https://goo.gl/S8ANuI"
  },
  {
    "latitude": "49.834913",
    "longitude": "24.0187292",
    "title": "",
    "titleCyrillic": "Пам'ятник *Жертвам комуністичних злочинів*",
    "date": "06.09.2014",
    "description": "Ідея спорудження пам'ятника виникла в колишнього політв'язня Василя Кубіва. Багато хто сприйняв цю ідею, як чергову фантазію, побажання, яке ніколи силами політв'язнів не буде реалізоване. Для того щоб повністю зосередитись на цій ідеї, Василь Кубів відмовився від посади голови Львівської обласної спілки політв'язнів України (ЛОО СПВУ). В 1992 р. створив і очолив профспілку ветеранів праці «Нескорені» з реквізитами окремої громадської організації, через яку здійснювались фінансові операції, пов'язані з будівництвом пам'ятника. 8 листопада 1997 року на площі М. Шашкевича, навпроти колишньої *Тюрми на Лонцького* вперше в Україні відкрито пам'ятник *Жертвам комуністичних злочинів*.",
    "descriptionCyrillic": "Карта Львов -от святогорской горы до высокозамковой-. [06.1]",
    "link": "https://goo.gl/jE2FA6"
  },
  {
    "latitude": "49.8338164",
    "longitude": "24.0201585",
    "title": "",
    "titleCyrillic": "Давній костел і шпиталь св. Лазаря",
    "date": "08.11.2014",
    "description": "",
    "descriptionCyrillic": "Карта Львов -от святогорской горы до высокозамковой-. [07.1]. Нині: тут базується дитячий хор *Дударик*. Шпиталь св. Лазаря був заснований львівським лавником, членом Вервечкового братства, Мареком Шарфенберґером-Остроґурським[1] у 1616 році. На власних землях, що на Калічій горі, він збудував два дерев'яні будинки. Один призначався для хворих, інший — для священника. Пізніше було прибудовано ще кілька кімнат шпиталю і дерев'яну каплицю. Незабаром, через висновок медиків про нібито шкідливість цього місця для здоров'я, шпиталь було вирішено перенести. Привід очевидно надуманий, враховуючи, що за кілька років терени були забудовані літніми резиденціями львівських патриціїв, серед яких в той час було багато медиків. 1620 року куплено кілька суміжних між собою ділянок на Сокільницькій вулиці (нині вулиця Коперника).",
    "link": "https://goo.gl/JRyGFi"
  },
  {
    "latitude": "49.835867",
    "longitude": "24.021872",
    "title": "",
    "titleCyrillic": "Давній палац князів Сапєг",
    "date": "08.11.2014",
    "description": "",
    "descriptionCyrillic": "Карта Львов -от святогорской горы до высокозамковой-. [08.1]. Нині: будинок Українського товариства охорони пам'яток історіі та культури.",
    "link": ""
  },
  {
    "latitude": "49.8323934",
    "longitude": "24.0240782",
    "title": "",
    "titleCyrillic": "Оборонительная казарма",
    "date": "08.11.2014",
    "description": "",
    "descriptionCyrillic": "Карта Львов -от святогорской горы до высокозамковой-. [09.1]",
    "link": ""
  },
  {
    "latitude": "49.8339112",
    "longitude": "24.0267264",
    "title": "",
    "titleCyrillic": "Максимилиановская башня 1",
    "date": "08.11.2014",
    "description": "",
    "descriptionCyrillic": "Карта Львов -от святогорской горы до высокозамковой-. [09.1]",
    "link": ""
  },
  {
    "latitude": "49.8354557",
    "longitude": "24.023531",
    "title": "",
    "titleCyrillic": "Максимилиановская башня 2",
    "date": "08.11.2014",
    "description": "",
    "descriptionCyrillic": "Карта Львов -от святогорской горы до высокозамковой-. [09.1]",
    "link": ""
  },
  {
    "latitude": "49.831734",
    "longitude": "24.021295",
    "title": "",
    "titleCyrillic": "Максимилиановская башня 3",
    "date": "08.11.2014",
    "description": "",
    "descriptionCyrillic": "Карта Львов -от святогорской горы до высокозамковой-. [09.1]",
    "link": ""
  },
  {
    "latitude": "49.830889",
    "longitude": "24.025018",
    "title": "",
    "titleCyrillic": "Максимилиановская башня 4",
    "date": "08.11.2014",
    "description": "",
    "descriptionCyrillic": "Карта Львов -от святогорской горы до высокозамковой-. [09.1]",
    "link": ""
  },
  {
    "latitude": "49.836467",
    "longitude": "24.022690",
    "title": "",
    "titleCyrillic": "Памятник Маркияну Шашкевичу",
    "date": "08.11.2014",
    "description": "",
    "descriptionCyrillic": "Карта Львов -от святогорской горы до высокозамковой-. [10.1]",
    "link": ""
  },
  /*{
    "latitude": "49.837154",
    "longitude": "24.023218",
    "title": "",
    "titleCyrillic": "Пам'ятник рюкзаку",
    "date": "X",
    "description": "",
    "descriptionCyrillic": "Карта Львов -от святогорской горы до высокозамковой-. [11.1]",
    "link": ""
  },*/
  {
    "latitude": "49.8396942",
    "longitude": "24.0212077",
    "title": "",
    "titleCyrillic": "Памятник Франко",
    "date": "*",
    "description": "",
    "descriptionCyrillic": "Карта Львов -от святогорской горы до высокозамковой-. [12.1]",
    "link": ""
  },
  {
    "latitude": "49.8402222",
    "longitude": "24.0223818",
    "title": "",
    "titleCyrillic": "Университет Франко",
    "date": "*",
    "description": "",
    "descriptionCyrillic": "Карта Львов -от святогорской горы до высокозамковой-. [13.1]",
    "link": ""
  },
  {
    "latitude": "49.8411658",
    "longitude": "24.0215827",
    "title": "Sientists house",
    "titleCyrillic": "Дом ученых",
    "date": "*",
    "description": "",
    "descriptionCyrillic": "Карта Львов -от святогорской горы до высокозамковой-. [14.1]",
    "link": ""
  },
  {
    "latitude": "49.8415961",
    "longitude": "24.0225523",
    "title": "",
    "titleCyrillic": "Памятник погибшим милиционерам охраняющих украинское государство",
    "date": "*",
    "description": "",
    "descriptionCyrillic": "Карта Львов -от святогорской горы до высокозамковой-. [15.1]",
    "link": ""
  },
  {
    "latitude": "49.8425687",
    "longitude": "24.0171946",
    "title": "",
    "titleCyrillic": "Костел св. Анны",
    "date": "*",
    "description": "",
    "descriptionCyrillic": "Карта Львов -от святогорской горы до высокозамковой-. [16.1]",
    "link": ""
  },
  {
    "latitude": "49.8432625",
    "longitude": "24.0219158",
    "title": "",
    "titleCyrillic": "Монастырь св. Бигиды. Наст. тюрьма",
    "date": "*",
    "description": "",
    "descriptionCyrillic": "Карта Львов -от святогорской горы до высокозамковой-. [17.1]",
    "link": ""
  },
  {
    "latitude": "49.8360459",
    "longitude": "24.0259962",
    "title": "",
    "titleCyrillic": "Памятник Василию Стефаныку",
    "date": "08.11.2014",
    "description": "",
    "descriptionCyrillic": "Карта Львов -от святогорской горы до высокозамковой-. [18.1]",
    "link": ""
  },
  {
    "latitude": "49.8378647",
    "longitude": "24.0268227",
    "title": "",
    "titleCyrillic": "Дворец Потоцких",
    "date": "07.01.2015",
    "description": "",
    "descriptionCyrillic": "Карта Львов -от святогорской горы до высокозамковой-. [19.1]",
    "link": ""
  },
  /*{
    "latitude": "49.8373139",
    "longitude": "24.0285226",
    "title": "",
    "titleCyrillic": "Пам'ятник Степану Тудору",
    "date": "X",
    "description": "",
    "descriptionCyrillic": "Карта Львов -от святогорской горы до высокозамковой-. [20.1]",
    "link": ""
  },*/
  {
    "latitude": "49.8343434",
    "longitude": "24.0314791",
    "title": "",
    "titleCyrillic": "Костел св. Николая ордена тринитариев",
    "date": "08.11.2014",
    "description": "",
    "descriptionCyrillic": "Карта Львов -от святогорской горы до высокозамковой-. [21.1]",
    "link": ""
  },
  {
    "latitude": "49.8356886",
    "longitude": "24.0323219",
    "title": "",
    "titleCyrillic": "Памятник Грушевскому",
    "date": "08.11.2014",
    "description": "",
    "descriptionCyrillic": "Карта Львов -от святогорской горы до высокозамковой-. [22.1]",
    "link": ""
  },
  {
    "latitude": "49.8386354",
    "longitude": "24.030542",
    "title": "",
    "titleCyrillic": "Готель Жорж",
    "date": "*",
    "description": "",
    "descriptionCyrillic": "Карта Львов -от святогорской горы до высокозамковой-. [23.1]",
    "link": ""
  },
  {
    "latitude": "49.8394351",
    "longitude": "24.0300473",
    "title": "",
    "titleCyrillic": "Памятник Адаму Мицкевичу",
    "date": "*",
    "description": "",
    "descriptionCyrillic": "Карта Львов -от святогорской горы до высокозамковой-. [24.1]",
    "link": ""
  },
  {
    "latitude": "49.839705",
    "longitude": "24.028202",
    "title": "",
    "titleCyrillic": "Дом Гауснера",
    "date": "*",
    "description": "",
    "descriptionCyrillic": "Карта Львов -от святогорской горы до высокозамковой-. [25.1]. 1809-1822",
    "link": ""
  },
  {
    "latitude": "49.8397603",
    "longitude": "24.029311",
    "title": "",
    "titleCyrillic": "Фонтан-источник с Богоматерью - покровительницей города",
    "date": "*",
    "description": "",
    "descriptionCyrillic": "Карта Львов -от святогорской горы до высокозамковой-. [26.1]",
    "link": ""
  },
  {
    "latitude": "49.841063",
    "longitude": "24.0283139",
    "title": "",
    "titleCyrillic": "Памятник Тарасу Шевченко",
    "date": "*",
    "description": "",
    "descriptionCyrillic": "Карта Львов -от святогорской горы до высокозамковой-. [27.1]",
    "link": ""
  },
  {
    "latitude": "49.8414994",
    "longitude": "24.0290273",
    "title": "",
    "titleCyrillic": "Костел Свв. апп. Петра и Павла ордена иезуитов",
    "date": "*",
    "description": "",
    "descriptionCyrillic": "Карта Львов -от святогорской горы до высокозамковой-. [28.1]",
    "link": ""
  },
  {
    "latitude": "49.8439534",
    "longitude": "24.0262666",
    "title": "",
    "titleCyrillic": "Национальный академический театр оперы и балета им. Соломии Крушельницкой",
    "date": "*",
    "description": "",
    "descriptionCyrillic": "Карта Львов -от святогорской горы до высокозамковой-. [29.1]",
    "link": ""
  },
  {
    "latitude": "49.8441843",
    "longitude": "24.0275387",
    "title": "",
    "titleCyrillic": "Национальный академический украинский драматический театр им. Марии Заньковецкой",
    "date": "*",
    "description": "",
    "descriptionCyrillic": "Карта Львов -от святогорской горы до высокозамковой-. [30.1]",
    "link": ""
  },
  {
    "latitude": "49.8481982",
    "longitude": "24.0391314",
    "title": "",
    "titleCyrillic": "Высокий замок",
    "date": "*",
    "description": "",
    "descriptionCyrillic": "Карта Львов -от святогорской горы до высокозамковой-. [01.2]",
    "link": ""
  },
  {
    "latitude": "49.8485025",
    "longitude": "24.0373377",
    "title": "",
    "titleCyrillic": "Парк высокого замка",
    "date": "*",
    "description": "",
    "descriptionCyrillic": "Карта Львов -от святогорской горы до высокозамковой-. [02.2]",
    "link": ""
  },
  /*{
    "latitude": "49.8538545",
    "longitude": "24.0344888",
    "title": "",
    "titleCyrillic": "Костел св. Мартина",
    "date": "X",
    "description": "",
    "descriptionCyrillic": "Карта Львов -от святогорской горы до высокозамковой-. [03.2]",
    "link": ""
  },*/
  /*{
    "latitude": "49.8517959",
    "longitude": "24.0307593",
    "title": "",
    "titleCyrillic": "Церква Проскеви П'ятниці УПЦКП",
    "date": "X",
    "description": "",
    "descriptionCyrillic": "Карта Львов -от святогорской горы до высокозамковой-. [04.2]",
    "link": ""
  },*/
  {
    "latitude": "49.849106",
    "longitude": "24.0284499",
    "title": "",
    "titleCyrillic": "Церква св. Онуфрія",
    "date": "Х",
    "description": "",
    "descriptionCyrillic": "Карта Львов -от святогорской горы до высокозамковой-. [05.2]",
    "link": ""
  },
  {
    "latitude": "49.8474014",
    "longitude": "24.0289714",
    "title": "",
    "titleCyrillic": "Церква св. Миколая",
    "date": "Х",
    "description": "",
    "descriptionCyrillic": "Карта Львов -от святогорской горы до высокозамковой-. [06.2]",
    "link": ""
  },
  {
    "latitude": "49.8468501",
    "longitude": "24.0305452",
    "title": "",
    "titleCyrillic": "Костел св. Ивана Крестителя",
    "date": "*",
    "description": "",
    "descriptionCyrillic": "Карта Львов -от святогорской горы до высокозамковой-. [07.2]",
    "link": ""
  },
  {
    "latitude": "49.845405",
    "longitude": "24.031769",
    "title": "",
    "titleCyrillic": "Ансамбль монастыря бенедектинок",
    "date": "Х",
    "description": "",
    "descriptionCyrillic": "Карта Львов -от святогорской горы до высокозамковой-. [08.2]",
    "link": ""
  },
  /*{
    "latitude": "49.8442068",
    "longitude": "24.0364076",
    "title": "Church of the Purification of the Blessed Virgin Mary",
    "titleCyrillic": "Церква Стрітення Господнього",
    "date": "X",
    "description": "The Carmelite Convent was established in Lviv by Jakub Sobieski. Many particulars of its design (decorative vases, Andreas Schwaner's statues) were patterned after the Roman church of Santa Susanna. Its construction, commenced in 1642, was greatly delayed by the events of the Deluge. The Carmelites departed from the nunnery in 1792. It was later used as a metrology office. The Ukrainian Greek Catholic Church recently reconsecrated the church to Christian worship and dedicated it to the Presentation of Our Lord.",
    "descriptionCyrillic": "Карта Львов -от святогорской горы до высокозамковой-. [09.2]. Костел і монастир кармеліток босих зведені на «ґрунтах», наданих Якубом і Теофілією з Даниловичів Собеськими. Початково будівлі були дерев'яні. Проект кам'яного костелу розроблений італійським архітектором Джованні Баттистою Джизлені у 1642 році. За зразок послужив фасад храму Санта Сусанна в Римі, архітектора Карло Мадерно. Будівництво почато 1644 року і велось під керівництвом Яна Годного. Від 1683 року будівництвом керував Томаш Дубінський. Спорудження з перервами тривало від 1644 до 1692 року. Завершено завдяки фундації короля Яна III Собеського. Початково освячений як Костел Матері Божої з Лоретто.",
    "link": "https://goo.gl/ZacoER"
  },*/
  {
    "latitude": "49.842833",
    "longitude": "24.0356259",
    "title": "",
    "titleCyrillic": "Пороховая башня",
    "date": "",
    "description": "",
    "descriptionCyrillic": "Карта Львов -от святогорской горы до высокозамковой-. [10.2]. По археологическим данным эта историческая достопримечательность Львова была построена во второй половине XVI ст. Материалом для ее строительства послужили камни из разобранного в 1554 г. Городского арсенала. Пороховая башня входила в фортификационную систему города. Еще таких же четыре башни стояли на Губернаторских валах. Но, к сожалению, только одна из них сохранилась до наших времен. Башня размещалась на земляном валу за оборонительными укреплениями и глубоким рвом с водой и охраняла подступы к городу с восточной стороны. Она имеет форму срезанного эллипса, закругленная сторона которого обращена к предместью. Вид с правой стороны на пороховую башнюБашня перекрыта острым щипцом крыши. В грубых двухметровых стенах и в нижней части трехметровых стен, выложенных из камня, сделаны маленькие окна-бойницы.",
    "link": "http://otdyhaem.com.ua/lvovskaya/lvov/porohovaja-bashnja.html"
  },
  {
    "latitude": "49.8424517",
    "longitude": "24.0370836",
    "title": "",
    "titleCyrillic": "Костёл кармелитов босых",
    "date": "",
    "description": "",
    "descriptionCyrillic": "Карта Львов -от святогорской горы до высокозамковой-. [11.2]. Впервые костёл ордена кармелитов босых упоминается в 1634 году. Построен, возможно, по проекту архитектора Я. Покоры (Покоровича), сына львовского архитектора итальянского происхождения Адама де Лярто. Башни главного фасада были спроектированы архитектором А. Вондрашкой в 1835—1839 годах, а завершены при реставрации уже в 1906 году архитектором В. Галицким. Монастырь кармелитов, находившийся за восточной линией львовских фортификаций на холме, представлял собой оборонительный комплекс. Костёл выполнен из камня, трёхнефный и без апсид, перекрыт сводами. К костёлу примыкает прямоугольное в плане здание монастырских келий с внутренним двориком.",
    "link": "https://goo.gl/38QySB"
  },
  /*{
    "latitude": "49.849675",
    "longitude": "24.056379",
    "title": "",
    "titleCyrillic": "Костел св. Войцеха",
    "date": "X",
    "description": "",
    "descriptionCyrillic": "Карта Львов -от святогорской горы до высокозамковой-. [12.2]. Наст. Храм Священномученика Йосафата. Впервые костёл ордена кармелитов босых упоминается в 1634 году. Построен, возможно, по проекту архитектора Я. Покоры (Покоровича), сына львовского архитектора итальянского происхождения Адама де Лярто. Башни главного фасада были спроектированы архитектором А. Вондрашкой в 1835—1839 годах, а завершены при реставрации уже в 1906 году архитектором В. Галицким. Монастырь кармелитов, находившийся за восточной линией львовских фортификаций на холме, представлял собой оборонительный комплекс. Костёл выполнен из камня, трёхнефный и без апсид, перекрыт сводами. К костёлу примыкает прямоугольное в плане здание монастырских келий с внутренним двориком.",
    "link": ""
  },*/
  {
    "latitude": "49.8427336",
    "longitude": "24.0400915",
    "title": "",
    "titleCyrillic": "Пам'ятник товариству *Просвіта*",
    "date": "",
    "description": "",
    "descriptionCyrillic": "Карта Львов -от святогорской горы до высокозамковой-. [13.2].",
    "link": ""
  },
  {
    "latitude": "49.8424517",
    "longitude": "24.0414064",
    "title": "",
    "titleCyrillic": "Давній  костел і монастир францисканців",
    "date": "",
    "description": "",
    "descriptionCyrillic": "Карта Львов -от святогорской горы до высокозамковой-. [14.2].",
    "link": ""
  },
  {
    "latitude": "49.8418144",
    "longitude": "24.0407007",
    "title": "",
    "titleCyrillic": "Храм св. Георгія",
    "date": "",
    "description": "",
    "descriptionCyrillic": "Карта Львов -от святогорской горы до высокозамковой-. [15.2].",
    "link": ""
  },
  {
    "latitude": "49.8423234",
    "longitude": "24.0455954",
    "title": "",
    "titleCyrillic": "Костел і монастир францисканок",
    "date": "",
    "description": "",
    "descriptionCyrillic": "Карта Львов -от святогорской горы до высокозамковой-. [16.2].",
    "link": ""
  },
  {
    "latitude": "49.841087",
    "longitude": "24.0465681",
    "title": "",
    "titleCyrillic": "Костел св. Антонія",
    "date": "",
    "description": "",
    "descriptionCyrillic": "Карта Львов -от святогорской горы до высокозамковой-. [17.2].",
    "link": ""
  },
  {
    "latitude": "49.8448254",
    "longitude": "24.0303137",
    "title": "",
    "titleCyrillic": "Давній костел св. Марії Сніжної",
    "date": "",
    "description": "",
    "descriptionCyrillic": "Карта Львов -от святогорской горы до высокозамковой-. [18.2].",
    "link": ""
  },
  /*{
    "latitude": "49.8433178",
    "longitude": "24.03222",
    "title": "",
    "titleCyrillic": "Будинок Пори року",
    "date": "X",
    "description": "",
    "descriptionCyrillic": "Карта Львов -от святогорской горы до высокозамковой-. [19.2].",
    "link": ""
  },*/
  {
    "latitude": "49.843003",
    "longitude": "24.0316675",
    "title": "",
    "titleCyrillic": "Пам'ятник винахідникам гасової лампи",
    "date": "*",
    "description": "",
    "descriptionCyrillic": "Карта Львов -от святогорской горы до высокозамковой-. [20.2]. Ігнатію Лукашевічу та Яну Зегу",
    "link": ""
  },
  {
    "latitude": "49.8427297",
    "longitude": "24.0340359",
    "title": "",
    "titleCyrillic": "Давній домініканський костел",
    "date": "*",
    "description": "",
    "descriptionCyrillic": "Карта Львов -от святогорской горы до высокозамковой-. [21.2].",
    "link": ""
  },
  {
    "latitude": "49.842357",
    "longitude": "24.0336483",
    "title": "",
    "titleCyrillic": "Пам'ятник Никіфорові (Єпіфанію) Дровняку",
    "date": "*",
    "description": "",
    "descriptionCyrillic": "Карта Львов -от святогорской горы до высокозамковой-. [22.2].",
    "link": ""
  },
  /*{
    "latitude": "49.8427433",
    "longitude": "24.0346241",
    "title": "",
    "titleCyrillic": "Давнії королівський арсенал",
    "date": "X",
    "description": "",
    "descriptionCyrillic": "Карта Львов -от святогорской горы до высокозамковой-. [23.2]. Нині: державний архів.",
    "link": ""
  },*/
  {
    "latitude": "49.8425885",
    "longitude": "24.0347623",
    "title": "",
    "titleCyrillic": "Пам'ятник Івану Федорову",
    "date": "*",
    "description": "",
    "descriptionCyrillic": "Карта Львов -от святогорской горы до высокозамковой-. [24.2].",
    "link": ""
  },
  {
    "latitude": "49.842393",
    "longitude": "24.0349165",
    "title": "",
    "titleCyrillic": "Фрагменти автентичних міськіх мурів1",
    "date": "*",
    "description": "",
    "descriptionCyrillic": "Карта Львов -от святогорской горы до высокозамковой-. [25.2].",
    "link": ""
  },
  {
    "latitude": "49.841155",
    "longitude": "24.028698",
    "title": "",
    "titleCyrillic": "Фрагменти автентичних міськіх мурів2",
    "date": "*",
    "description": "",
    "descriptionCyrillic": "Карта Львов -от святогорской горы до высокозамковой-. [25.2].",
    "link": ""
  },
  /*{
    "latitude": "49.8420093",
    "longitude": "24.0342928",
    "title": "",
    "titleCyrillic": "Ансамбль споруд Успенського братства",
    "date": "X",
    "description": "",
    "descriptionCyrillic": "Карта Львов -от святогорской горы до высокозамковой-. [26.2].",
    "link": ""
  },*/
  /*{
    "latitude": "49.8413658",
    "longitude": "24.0352081",
    "title": "",
    "titleCyrillic": "Давній міський арсенал",
    "date": "X",
    "description": "",
    "descriptionCyrillic": "Карта Львов -от святогорской горы до высокозамковой-. [27.2]. Нині: музей старовинної сброї.",
    "link": ""
  },*/
  /*{
    "latitude": "49.8415153",
    "longitude": "24.036849",
    "title": "",
    "titleCyrillic": "Будинок Галицького намісництва",
    "date": "X",
    "description": "",
    "descriptionCyrillic": "Карта Львов -от святогорской горы до высокозамковой-. [28.2].",
    "link": ""
  },*/
  /*{
    "latitude": "49.8409536",
    "longitude": "24.036945",
    "title": "",
    "titleCyrillic": "Давній палац губернаторів",
    "date": "X",
    "description": "",
    "descriptionCyrillic": "Карта Львов -от святогорской горы до высокозамковой-. [29.2]. Нині: Львівська обласна рада.",
    "link": ""
  },*/
  {
    "latitude": "49.8411488",
    "longitude": "24.0360054",
    "title": "",
    "titleCyrillic": "Пам'ятник Вячеславу Чорноволу",
    "date": "X",
    "description": "",
    "descriptionCyrillic": "Карта Львов -от святогорской горы до высокозамковой-. [30.2].",
    "link": ""
  },
];
var lviv = [];

/*
  new google.maps.LatLng(49.8395998,24.036963),  /* [31.2] Museum Iogana Pinzelja 
  new google.maps.LatLng(49.8436155,24.0293321), /* [32.2] Cerkva Preobrazenija Gospodn'ogo 
  new google.maps.LatLng(49.8433496,24.0301937), /* [33.2] Armjansky sobor 
  new google.maps.LatLng(49.8432332,24.0306651), /* [33.2] Armjansky ansambl' 
  new google.maps.LatLng(49.8427049,24.032317),  /* [34.2] Museum Apteka 'under black eagle' 
  new google.maps.LatLng(49.841494,24.0318174),  /* [35.2] Pl. Runok 
  new google.maps.LatLng(49.8411407,24.0332698), /* [37.2] Maisternya Shokolada 
  new google.maps.LatLng(49.8393918,24.03444),   /* [38.2] Costel Bernardincev 
  new google.maps.LatLng(49.8425959,24.028472),  /* [42.2] Palac Dedushinskih 
  new google.maps.LatLng(49.8422065,24.0281389), /* [43.2] Pam. Lviv. Bromarjam 
  new google.maps.LatLng(49.8422584,24.0283266), /* [44.2] Veza Kramariv 
  new google.maps.LatLng(49.8412768,24.0293354), /* [47.2] Pam. Ivanu Podkovi 
  new google.maps.LatLng(49.8407257,24.0305728), /* [49.2] Katedral'nii Sobor Usbeniya Prechistoi Materi Bozoi 
  new google.maps.LatLng(49.8406788,24.0310255), /* [50.2] Kaplica Boimiv 
  new google.maps.LatLng(49.8394383,24.032552),  /* [53.2] Pam. Damilu Galickomu 
  new google.maps.LatLng(49.8380337,24.0318827), /* [55.2] Pam. V. Ivasyku 


not visited
  new google.maps.LatLng(49.839512,24.0362414),  /* Park Olega Veschego 
  new google.maps.LatLng(49.8415245,24.035994),  /* Park 'na Valah' 

  /* Lviv: ot svyatogorskoy gory do vysokozamkovoy 
  new google.maps.LatLng(49.841306,24.032288),   /* [36.2] Kruivka 
  new google.maps.LatLng(49.8430807,24.0281174), /* [41.2] Nac. museum 
  new google.maps.LatLng(0,0),                   /* [54.2] Palac Besyadskih /not found/

  /* Zaklady
  3metly
  Shokoladka
  Strudel house
  Credens cafe
  Christofor
  P'jalna
  Svit cavy
  Kumpel
  Burger buffet
  Manifest
  Buket vina
  Lviv copal'nja
  Play bar
  Play bar -> naproty
  Enjoy
  Pirozkova hata
  Lyft
  Livyi bereg
  Sytyi pes
  Dim legend
*/